{
  "generatedDate": "2026-02-06",
  "stream": "Glossary Expansion",
  "totalTerms": 10,
  "terms": [
    {
      "term": "CF 7501 (Entry Summary)",
      "slug": "cf-7501-entry-summary",
      "category": "US Customs Documentation",
      "primaryKeyword": "CF 7501 entry summary",
      "secondaryKeywords": ["CBP Form 7501", "customs entry summary filing", "7501 entry requirements", "customs entry documentation"],
      "searchIntent": "informational",
      "competitorContentScore": 6,
      "opportunityRating": "High",
      "definition": "CBP Form 7501, commonly known as the Entry Summary, is a mandatory document required by U.S. Customs and Border Protection (CBP) for all commercial goods imported into the United States. This form captures critical data points including appraisement (valuation), classification (HS codes), country of origin, and duty calculations. Importers must file the Entry Summary within 10 working days from the time merchandise enters the United States, as mandated by 19 U.S.C. 1484 and 19 CFR 141.61. The form serves as the foundation for CBP's assessment of duties, taxes, and fees, while also determining compliance with trade regulations and eligibility for preferential trade programs. Modern customs operations increasingly rely on electronic filing through CBP's Automated Commercial Environment (ACE), where Entry Summary data integrates directly with cargo release systems and post-release accounting modules.",
      "technicalContext": "Filed electronically via ACE ABI; requires coordination with Entry Type codes",
      "relatedSystems": ["ACE Portal", "ABI", "ISF", "Entry Type 86"],
      "wordCount": 152,
      "relatedIntegrations": ["CargoWise to ACE", "Descartes to NetSuite", "Customs entry automation"]
    },
    {
      "term": "AES (Automated Export System)",
      "slug": "aes-automated-export-system",
      "category": "US Export Compliance",
      "primaryKeyword": "AES Automated Export System",
      "secondaryKeywords": ["AES filing requirements", "Electronic Export Information EEI", "AES customs export", "automated export filing"],
      "searchIntent": "informational",
      "competitorContentScore": 7,
      "opportunityRating": "Medium",
      "definition": "The Automated Export System (AES) is the U.S. Customs and Border Protection (CBP) electronic platform that facilitates the filing of Electronic Export Information (EEI) and manifest data for exports leaving the United States. Operating nationwide at all ports and across all transportation modes, AES was designed to ensure compliance with export regulations, improve trade statistics accuracy, reduce duplicate reporting to multiple government agencies, and enhance customer service for exporters. The system enables U.S. businesses to file shipment data electronically through Electronic Data Interchange (EDI), allowing for real-time error correction and instant validation of export declarations. AES serves as the primary enforcement mechanism for the Census Bureau's Foreign Trade Regulations and supports compliance with the Export Administration Regulations (EAR) and International Traffic in Arms Regulations (ITAR), making it an essential component of any exporter's compliance infrastructure.",
      "technicalContext": "Operates via EDI; replaces paper Shipper's Export Declaration (SED)",
      "relatedSystems": ["ACE", "EEI", "Census Bureau", "CBP"],
      "wordCount": 154,
      "relatedIntegrations": ["CargoWise AES integration", "SAP export compliance", "Oracle GTM"]
    },
    {
      "term": "AMS (Automated Manifest System)",
      "slug": "ams-automated-manifest-system",
      "category": "US Import Security",
      "primaryKeyword": "AMS Automated Manifest System",
      "secondaryKeywords": ["AMS filing customs", "automated manifest system requirements", "AMS ocean manifest", "CBP AMS filing"],
      "searchIntent": "informational",
      "competitorContentScore": 6,
      "opportunityRating": "High",
      "definition": "The Automated Manifest System (AMS) is a U.S. Customs and Border Protection (CBP) computerized information transfer system that requires air and ocean carriers to electronically submit complete cargo manifest information before arrival at U.S. ports of entry. Introduced in 2004 as a critical security safeguard, AMS mandates that carriers file electronic manifests containing detailed shipment data including consignee information, cargo descriptions, container details, and vessel voyage information. Ocean manifests must be filed electronically with CBP at least 24 hours before cargo is laden aboard a vessel at foreign ports (the "24-Hour Rule"). The system enhances border security by enabling advance risk assessment and targeting while streamlining customs clearance processes. AMS operates as a foundational component of CBP's layered security approach, integrating with Importer Security Filing (ISF) requirements and the Container Security Initiative (CSI) to provide comprehensive visibility into inbound cargo movements.",
      "technicalContext": "Requires FMC bond and International Carrier Bond; uses SCAC codes",
      "relatedSystems": ["ACE", "ISF", "CSI", "24-Hour Rule"],
      "wordCount": 155,
      "relatedIntegrations": ["CargoWise AMS filing", "Descartes AMS", "MercuryGate customs integration"]
    },
    {
      "term": "ISF-5 (Importer Security Filing - 5 Data Elements)",
      "slug": "isf-5-importer-security-filing",
      "category": "US Import Security",
      "primaryKeyword": "ISF-5 importer security filing",
      "secondaryKeywords": ["ISF 5 data elements", "FROB cargo filing", "ISF 5+2 requirements", "transit cargo ISF"],
      "searchIntent": "informational",
      "competitorContentScore": 5,
      "opportunityRating": "High",
      "definition": "ISF-5, or Importer Security Filing with 5 data elements, is a streamlined version of the standard ISF-10 required for specific categories of cargo including Foreign Cargo Remaining on Board (FROB), goods intended for immediate exportation (IE), and transportation and exportation (T&E) in-bond shipments. Unlike the standard ISF-10 which requires 10 data elements from importers plus 2 from carriers (the "10+2" rule), ISF-5 mandates submission of only 5 specific data elements: the booking party, the foreign port of unlading, the place of delivery, the ship-to party, and the commodity HTSUS number. All ISF-5 filings must be submitted to CBP at least 24 hours prior to cargo loading at the foreign port, identical to standard ISF timing requirements. This reduced filing requirement recognizes the lower security risk profile of cargo that will not enter U.S. commerce while still providing CBP with essential visibility for targeting and risk assessment purposes.",
      "technicalContext": "Filed via ACE; applies to FROB, IE, and T&E shipments only",
      "relatedSystems": ["ACE", "AMS", "ISF-10", "HTSUS"],
      "wordCount": 158,
      "relatedIntegrations": ["Descartes ISF filing", "CargoWise security filing", "Customs broker automation"]
    },
    {
      "term": "Entry Type 86 (Section 321 De Minimis)",
      "slug": "entry-type-86-section-321",
      "category": "US Import Programs",
      "primaryKeyword": "Entry Type 86 Section 321",
      "secondaryKeywords": ["Section 321 de minimis", "Type 86 entry customs", "de minimis exemption 800", "ecommerce customs entry"],
      "searchIntent": "informational",
      "competitorContentScore": 7,
      "opportunityRating": "High",
      "definition": "Entry Type 86 is a voluntary customs entry type specifically designed for the filing and electronic release of e-commerce shipments that qualify under CBP's de minimis exemption (Section 321 of the Tariff Act of 1930). The de minimis provision allows admission of articles free of duty and tax when the aggregate fair retail value of articles imported by one person on one day does not exceed $800 USD. Entry Type 86 was introduced in 2019 to accommodate the explosive growth of e-commerce shipments while streamlining the clearance process for low-value goods. Unlike traditional formal entries, Type 86 entries can be filed by customs brokers and are processed through a simplified data set, enabling rapid release. However, CBP has recently tightened compliance requirements due to concerns about split shipments, undervaluation, and prohibited goods entering through this streamlined process, making accurate data and proper classification more critical than ever for importers utilizing this entry type.",
      "technicalContext": "Filed via ACE; requires customs broker participation; $800 threshold",
      "relatedSystems": ["ACE", "Section 321", "ISF", "Customs Broker"],
      "wordCount": 162,
      "relatedIntegrations": ["Descartes Type 86", "CargoWise de minimis", "Flexport Section 321"]
    },
    {
      "term": "ACE Portal (Automated Commercial Environment)",
      "slug": "ace-portal-automated-commercial-environment",
      "category": "US Customs Systems",
      "primaryKeyword": "ACE Portal customs",
      "secondaryKeywords": ["Automated Commercial Environment", "ACE CBP portal", "ACE entry filing", "ACE cargo release"],
      "searchIntent": "navigational",
      "competitorContentScore": 8,
      "opportunityRating": "Medium",
      "definition": "The Automated Commercial Environment (ACE) is the U.S. electronic Single Window platform operated by Customs and Border Protection (CBP) for all trade processing, serving as the central system through which the trade community reports imports and exports while the government determines admissibility. ACE integrates all manifest, cargo release, post-release, export, and Partner Government Agency (PGA) data into a unified platform, replacing legacy systems and providing real-time processing capabilities. Trade users access ACE through two primary channels: the ACE Secure Data Portal for web-based interactions and the Automated Broker Interface (ABI) for system-to-system electronic data interchange. The portal supports critical functions including entry summary filing, cargo release requests, entry status queries, protest submissions, and account management. ACE serves as the backbone of modern U.S. customs operations, enabling streamlined communication between importers, exporters, customs brokers, carriers, and government agencies while supporting risk-based targeting and compliance enforcement.",
      "technicalContext": "Single Window platform; replaces ACS; supports ABI and Portal access",
      "relatedSystems": ["ABI", "CF 7501", "AMS", "ISF", "PGA"],
      "wordCount": 163,
      "relatedIntegrations": ["CargoWise ACE integration", "Descartes ACE Portal", "NetSuite customs connector"]
    },
    {
      "term": "C-TPAT (Customs-Trade Partnership Against Terrorism)",
      "slug": "c-tpat-customs-trade-partnership",
      "category": "Supply Chain Security",
      "primaryKeyword": "C-TPAT certification",
      "secondaryKeywords": ["Customs Trade Partnership Against Terrorism", "C-TPAT requirements", "supply chain security program", "C-TPAT validation"],
      "searchIntent": "informational",
      "competitorContentScore": 7,
      "opportunityRating": "Medium",
      "definition": "The Customs-Trade Partnership Against Terrorism (C-TPAT) is a voluntary supply chain security program led by U.S. Customs and Border Protection (CBP) that partners with companies to secure the international supply chain and protect U.S. borders from terrorist infiltration. Companies achieving C-TPAT certification must implement documented security procedures throughout their international supply chains, covering areas including procedural security, physical security, personnel security, education and training, access controls, and business partner requirements. Certified partners are considered low-risk and receive significant benefits including reduced customs examinations, expedited cargo processing, access to the Free and Secure Trade (FAST) lanes at land borders, priority consideration for CBP expedited inspection programs, and eligibility for Mutual Recognition Arrangements with foreign customs administrations. C-TPAT validations (not audits) are conducted by CBP to verify security measures, and partners must undergo revalidation within four years of initial certification to maintain their status.",
      "technicalContext": "Voluntary program; requires security profile submission; CBP validation process",
      "relatedSystems": ["CBP", "FAST lanes", "Mutual Recognition", "Importer Security"],
      "wordCount": 156,
      "relatedIntegrations": ["Supply chain visibility platforms", "CargoWise security modules", "SAP GTS"]
    },
    {
      "term": "ACI (Advance Commercial Information - Canada)",
      "slug": "aci-advance-commercial-information-canada",
      "category": "Canadian Customs",
      "primaryKeyword": "ACI Advance Commercial Information Canada",
      "secondaryKeywords": ["ACI eManifest Canada", "Canada customs advance filing", "CBSA ACI requirements", "ACI highway cargo"],
      "searchIntent": "informational",
      "competitorContentScore": 5,
      "opportunityRating": "High",
      "definition": "Advance Commercial Information (ACI) is Canada's mandatory electronic pre-arrival trade information system administered by the Canada Border Services Agency (CBSA), requiring carriers and freight forwarders to submit commercial cargo and conveyance data before arriving at the Canadian border. Implemented in phases starting in 2004, ACI mandates that carriers in all transportation modes (air, marine, highway, rail) electronically transmit dispatch-level and shipment-level information including commercial invoices, bills of lading, and cargo descriptions prior to moving freight across the border. The system enables CBSA to perform advance risk assessments, identify high-risk shipments, and facilitate the expedited processing of legitimate trade. Full ACI compliance requires submission of all required Highway Cargo and Conveyance data elements through the eManifest portal or electronic data interchange. ACI serves as Canada's equivalent to the U.S. AMS/ISF requirements and is a critical component of cross-border trade compliance for companies operating between the United States and Canada.",
      "technicalContext": "Mandatory for all modes; filed via eManifest portal or EDI; 24-hour advance for marine",
      "relatedSystems": ["CBSA", "eManifest", "PARS", "RNS"],
      "wordCount": 154,
      "relatedIntegrations": ["CargoWise ACI filing", "Descartes Canadian customs", "MercuryGate cross-border"]
    },
    {
      "term": "EMCS (Excise Movement and Control System - EU)",
      "slug": "emcs-excise-movement-control-system-eu",
      "category": "EU Excise Compliance",
      "primaryKeyword": "EMCS Excise Movement Control System",
      "secondaryKeywords": ["EU excise goods movement", "EMCS declaration", "excise duty suspension", "EMCS ARC number"],
      "searchIntent": "informational",
      "competitorContentScore": 4,
      "opportunityRating": "High",
      "definition": "The Excise Movement and Control System (EMCS) is the European Union's computerized system for recording and monitoring the movement of excise goods—including alcohol, tobacco, and energy products—between EU member states under duty suspension or duty-paid arrangements. Operational since 2011 and utilized by more than 200,000 registered economic operators, EMCS provides a trader-to-trader electronic link that tracks excise goods from dispatch to receipt, ensuring compliance with EU excise duty regulations. The system generates a unique Administrative Reference Code (ARC) for each movement, enabling real-time tracking and validation of excise goods throughout the supply chain. EMCS facilitates both duty-suspended movements (where excise duty becomes due only upon release for consumption) and duty-paid movements (where duty has already been paid in the originating member state). Recent system enhancements have improved interoperability with export systems and strengthened controls against fraud in the intra-EU trade of excise goods.",
      "technicalContext": "Generates ARC numbers; tracks duty-suspended and duty-paid movements; EU-wide",
      "relatedSystems": ["EORI", "SEED", "EU Customs", "Excise Number"],
      "wordCount": 155,
      "relatedIntegrations": ["Descartes EMCS", "SAP ECC excise", "Oracle GTM excise"]
    },
    {
      "term": "EORI Number (Economic Operators Registration and Identification)",
      "slug": "eori-economic-operators-registration-identification",
      "category": "EU Customs Identification",
      "primaryKeyword": "EORI number registration",
      "secondaryKeywords": ["Economic Operators Registration Identification", "EU EORI number", "customs EORI", "EORI validation"],
      "searchIntent": "informational",
      "competitorContentScore": 7,
      "opportunityRating": "Medium",
      "definition": "The Economic Operators Registration and Identification (EORI) number is a unique identification number assigned by EU customs authorities to economic operators and other persons engaged in customs-related activities within the European Union customs territory. Introduced by Commission Regulation (EC) No 312/2009, the EORI number uniquely identifies businesses in their relations with customs authorities across all EU member states, replacing previous national identification systems. An economic operator can hold only one valid EORI number at any time, which must be communicated to customs authorities in all member states where customs activities occur. The EORI number, which begins with the two-letter country code of the issuing member state followed by a unique identifier, is mandatory for any business involved in importing, exporting, transit operations, or other customs procedures within the EU. The system enables customs authorities to identify and track economic operators throughout the EU, facilitating risk assessment, security controls, and the exchange of customs information between member states.",
      "technicalContext": "Assigned by member state customs; format: [CC][unique number]; required for all customs activities",
      "relatedSystems": ["EU Customs", "TARIC", "NCTS", "EMCS"],
      "wordCount": 162,
      "relatedIntegrations": ["SAP GTS EORI validation", "Oracle GTM", "CargoWise EU customs"]
    }
  ]
}
